In [79]:
#import the dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [80]:
#copy/paste the cleaning from previous jupyter notebook for consistency
williamson_housing = "williamson_data/williamson_housing.csv"
travis_occupancy = "Travis_County_Data/Occupancy.csv"
hays_total_housing_units = "hays_data/hays_total_housing_units.csv"


hays_total_housing_units_data_df = pd.read_csv(hays_total_housing_units,thousands = ",")
hays_total_housing_units_data_clean_df = hays_total_housing_units_data_df.dropna(how = "any")

williamson_housing_data_df = pd.read_csv(williamson_housing,sep='\t',thousands = ",")

travis_occupancy_data_df = pd.read_csv(travis_occupancy)

In [81]:
#make df for occupied hays housing
hays_total_housing_units_data_clean_df = hays_total_housing_units_data_clean_df.drop(["2006"], axis = 1)

occupied_hays = hays_total_housing_units_data_clean_df.drop([0,2,3,4])

occupied_hays

,HOUSING OCCUPANCY,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
1,Occupied housing units,44803.0,47008.0,48709.0,54422.0,56754.0,57395.0,60739.0,63497.0,67346.0,71267.0

In [83]:
#make df for just vacant hays housing
vacant_hays = hays_total_housing_units_data_clean_df.drop([0,1,3,4])
vacant_hays

,HOUSING OCCUPANCY,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
2,Vacant housing units,4583.0,4258.0,4467.0,5325.0,5079.0,6943.0,6568.0,7232.0,5631.0,4219.0

In [84]:
#make df for occupied williamson
occupied_williamson = williamson_housing_data_df.drop([0,2,3,4])
occupied_williamson

,HOUSING OCCUPANCY,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
1,Occupied housing units,121899.0,93.30%,93.50%,152739.0,156738.0,156215.0,161887.0,164805.0,170987.0,173125.0

In [85]:
#make df for vacant williamson
vacant_williamson = williamson_housing_data_df.drop([0,1,3,4])
vacant_williamson

,HOUSING OCCUPANCY,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
2,Vacant housing units,9274.0,6.70%,6.50%,10525.0,11785.0,10988.0,9257.0,10868.0,10013.0,13850.0

In [23]:
travis_occupancy_data_df

,HOUSING OCCUPANCY,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Total housing units,405281.0,418425.0,428146.0,442335.0,447125.0,450876.0,461551.0,474957.0,486544.0,499033.0
1,Occupied housing units,368578.0,381307.0,391589.0,403638.0,410683.0,414318.0,428889.0,437375.0,446342.0,457810.0
2,Vacant housing units,36703.0,37118.0,36557.0,38697.0,36442.0,36558.0,32662.0,37582.0,40202.0,41223.0
3,Homeowner vacancy rate,2.2,2.6,2.7,2.1,3.5,1.6,1.3,1.1,1.6,1.7
4,Rental vacancy rate,9.2,7.9,7.3,6.6,4.6,4.5,4.4,4.6,6.7,6.2